## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs"
        name                              = "findatppr377logs"
        tags                              = {
            "Environment"      = "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              + "20.57.41.98",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-377applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-377httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.dns_a_record_set.web_app_service_ip_address will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_app_service_ip_address" {
      + addrs = (known after apply)
      + host  = (known after apply)
      + id    = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Cdn/profiles/find-a-tp-pr-377-cdn/originGroups/find-a-tp-pr-377-origingroup"
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "find-a-tp-pr-377origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 500
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Cdn/profiles/find-a-tp-pr-377-cdn/afdEndpoints/find-a-tp-pr-377-cdnendpoint"
      + cdn_frontdoor_origin_group_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Cdn/profiles/find-a-tp-pr-377-cdn/originGroups/find-a-tp-pr-377-origingroup"
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "find-a-tp-pr-377route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault.default will be created
  + resource "azurerm_key_vault" "default" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "049a4264-d53c-47da-ba4b-d8f2dc8ff057"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = (known after apply)
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-377-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "s177d01-ntp-pr-377"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment"      = "pr-377"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + tenant_id                     = "9c7d9dd3-840c-4b3f-818e-552865082e16"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + ip_rules                   = [
              + "13.95.154.242",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpredisconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpRedis"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be created
  + resource "azurerm_linux_web_app" "default" {
      + app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_PROFILERFEATURE_VERSION"             = "1.0.0"
          + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"             = "1.0.0"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ASPNETCORE_ENVIRONMENT"                          = "Development"
          + "ApplicationInsightsAgent_EXTENSION_VERSION"      = "~2"
          + "BlobStorage_AccountName"                         = "s177p01sharedtpdata"
          + "BlobStorage_ClientId"                            = "fdd09510-77b0-419f-b67c-2b5a25a073f0"
          + "BlobStorage_ContainerName"                       = "ntp-tp-data"
          + "BlobStorage_TenantId"                            = "9c7d9dd3-840c-4b3f-818e-552865082e16"
          + "DiagnosticServices_EXTENSION_VERSION"            = "~3"
          + "EmailSettings_AllSentToEnquirer"                 = "true"
          + "EmailSettings_AmalgamateResponses"               = "true"
          + "EmailSettings_MergeResponses"                    = "true"
          + "FatpAzureKeyVaultName"                           = "find-a-tp-pr-377-kv"
          + "InstrumentationEngine_EXTENSION_VERSION"         = "disabled"
          + "SnapshotDebugger_EXTENSION_VERSION"              = "disabled"
          + "XDT_MicrosoftApplicationInsights_BaseExtensions" = "disabled"
          + "XDT_MicrosoftApplicationInsights_Java"           = "1"
          + "XDT_MicrosoftApplicationInsights_Mode"           = "recommended"
          + "XDT_MicrosoftApplicationInsights_NodeJS"         = "1"
          + "XDT_MicrosoftApplicationInsights_PreemptSdk"     = "disabled"
        }
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "find-a-tp-pr-377"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "s177d01-ntp-pr-377"
      + service_plan_id                   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Web/serverfarms/find-a-tp-pr-377"
      + site_credential                   = (known after apply)
      + tags                              = {
          + "Environment"      = "pr-377"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + virtual_network_subnet_id         = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + application_logs {
              + file_system_level = "Information"

              + azure_blob_storage {
                  + level             = "Information"
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = 30
                  + sas_url           = (sensitive value)
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/"
          + http2_enabled                           = true
          + ip_restriction                          = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = [
                              + "7d5d31a0-be98-44a9-9999-12753218a5c3",
                            ]
                        },
                    ]
                  + name        = "Allow CDN Traffic"
                  + priority    = 65000
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = 1

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs|find-a-tp-pr-377-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-377-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "web_app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-377-webappservice"
      + name                           = "find-a-tp-pr-377-webappservice"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-377-webappserviceinfransg"
      + resource_group_name = "s177d01-ntp-pr-377"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = (known after apply)
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowFrontdoor"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureFrontDoor.Backend"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment"      = "pr-377"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377"
        name     = "s177d01-ntp-pr-377"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be created
  + resource "azurerm_storage_account_network_rules" "logs" {
      + bypass                     = [
          + "AzureServices",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = [
          + "13.95.154.242",
        ]
      + storage_account_id         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs"
      + virtual_network_subnet_ids = (known after apply)

      + private_link_access {
          + endpoint_resource_id = (known after apply)
          + endpoint_tenant_id   = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.keyvault_subnet will be created
  + resource "azurerm_subnet" "keyvault_subnet" {
      + address_prefixes                               = [
          + "10.0.8.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-377keyvault"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-377"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
        ]
      + virtual_network_name                           = "find-a-tp-pr-377-default"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet" "web_app_service_infra_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-377-webappserviceinfra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-377"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "find-a-tp-pr-377-default"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.app_service[0] will be created
  + resource "azurerm_subnet_nat_gateway_association" "app_service" {
      + id             = (known after apply)
      + nat_gateway_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Network/natGateways/find-a-tp-pr-377-default"
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_network_security_group_association.web_app_service_infra_allow_frontdoor_inbound_only[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "web_app_service_infra_allow_frontdoor_inbound_only" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_route_table_association.web_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet_route_table_association" "web_app_service_infra_subnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Network/routeTables/find-a-tp-pr-377-default"
      + subnet_id      = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be created
  + resource "azurerm_virtual_network" "default" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "find-a-tp-pr-377-default"
      + resource_group_name = "s177d01-ntp-pr-377"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment"      = "pr-377"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

Plan: 17 to add, 2 to change, 0 to destroy.
```
</details>